In [1]:
##pandas 
import pandas as pd

In [6]:
##series
##its a 1-d array object that can hold any datatype.
#similar to column in a table.

data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
##creating a series using dictionary 

data = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [9]:
data = [10,20,30]
index = ['a','b','c']

series1 = pd.Series(data, index = index)

print(series1)

a    10
b    20
c    30
dtype: int64

In [78]:
##data frame -- > 2d heterogenous tabular data with labeled values
##create a dataframe from dictionary

data = {
    'name':['anurag','vijay','karthik','venkat'],
    'age' : [26,26,21,22],
    'city':['manching','trier','trier','wettstatin']

}

df = pd.DataFrame(data)
print(df)

      name  age        city
0   anurag   26    manching
1    vijay   26       trier
2  karthik   21       trier
3   venkat   22  wettstatin

In [80]:
df

      name  age        city
0   anurag   26    manching
1    vijay   26       trier
2  karthik   21       trier
3   venkat   22  wettstatin

In [11]:
import numpy as np
np.array(df)

array([['anurag', 26, 'manching'],
       ['vijay', 26, 'trier'],
       ['karthik', 21, 'trier'],
       ['venkat', 22, 'wettstatin']], dtype=object)

In [105]:
#create a dataframe from list of dictionaries

data = [
    {'name':'anurag','age':26,'city':'manching'},
    {'name':'vijay','age':26,'city':'trier'},
    {'name':'karthik','age':21,'city':'trier'},
    {'name':'venkat','age':22,'city':'wetstattin'},

]

df2 = pd.DataFrame(data)
print(df2)

      name  age        city
0   anurag   26    manching
1    vijay   26       trier
2  karthik   21       trier
3   venkat   22  wetstattin

In [118]:
df = pd.read_csv('Alzheimers.csv')

df.head(5)

/var/folders/kz/m1xjpx2d707b07x9l1zkhz2r0000gn/T/ipykernel_28356/4068383796.py:1: DtypeWarning: Columns (17,18) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('Alzheimers.csv')

,RowId,YearStart,YearEnd,LocationAbbr,LocationDesc,Datasource,Class,Topic,Question,Response,...,QuestionID,ResponseID,LocationID,StratificationCategoryID1,StratificationID1,StratificationCategoryID2,StratificationID2,StratificationCategoryID3,StratificationID3,Report
0,BRFSS~2021~2021~9004~Q43~TOC11~AGE~RACE,2021,2021,WEST,West,BRFSS,Overall Health,Arthritis among older adults,Percentage of older adults ever told they have...,NaN,...,Q43,NaN,9004,AGE,AGE_OVERALL,RACE,HIS,NaN,NaN,NaN
1,BRFSS~2017~2017~9001~Q43~TOC11~AGE~OVERALL,2017,2017,NRE,Northeast,BRFSS,Overall Health,Arthritis among older adults,Percentage of older adults ever told they have...,NaN,...,Q43,NaN,9001,AGE,65PLUS,OVERALL,OVERALL,NaN,NaN,NaN
2,BRFSS~2019~2019~9002~Q02~TNC02~AGE~OVERALL,2019,2019,MDW,Midwest,BRFSS,Nutrition/Physical Activity/Obesity,Eating 3 or more vegetables daily,Percentage of older adults who are eating 3 or...,NaN,...,Q02,NaN,9002,AGE,AGE_OVERALL,OVERALL,OVERALL,NaN,NaN,NaN
3,BRFSS~2020~2020~59~Q43~TOC11~AGE~GENDER,2020,2020,US,"United States, DC & Territories",BRFSS,Overall Health,Arthritis among older adults,Percentage of older adults ever told they have...,NaN,...,Q43,NaN,59,AGE,65PLUS,GENDER,FEMALE,NaN,NaN,NaN
4,BRFSS~2020~2020~33~Q03~TMC01~AGE~GENDER,2020,2020,NH,New Hampshire,BRFSS,Mental Health,Frequent mental distress,Percentage of older adults who are experiencin...,NaN,...,Q03,NaN,33,AGE,5064,GENDER,FEMALE,NaN,NaN,NaN

In [106]:
##accessing data from dataframe.
df2

      name  age        city
0   anurag   26    manching
1    vijay   26       trier
2  karthik   21       trier
3   venkat   22  wetstattin

In [107]:
df2['name']

0     anurag
1      vijay
2    karthik
3     venkat
Name: name, dtype: object

In [108]:
df2.loc[3]

name        venkat
age             22
city    wetstattin
Name: 3, dtype: object

In [109]:
df2.iloc[2][2]

/var/folders/kz/m1xjpx2d707b07x9l1zkhz2r0000gn/T/ipykernel_28356/3510559951.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df2.iloc[2][2]

'trier'

In [110]:
##accessing the specified element 

df2.at[1,'age']

np.int64(26)

In [111]:
df2

      name  age        city
0   anurag   26    manching
1    vijay   26       trier
2  karthik   21       trier
3   venkat   22  wetstattin

In [112]:
##accessing a specified element using iat.

df2.iat[2,2]

'trier'

In [113]:
## data manipulation with dataframes.
#adding a column
df2['university'] = ['THI','TU','TU','THI']
df2

      name  age        city university
0   anurag   26    manching        THI
1    vijay   26       trier         TU
2  karthik   21       trier         TU
3   venkat   22  wetstattin        THI

In [114]:
#removing a column
df2 = df2.drop(['city'], axis=1)

In [115]:
df2

      name  age university
0   anurag   26        THI
1    vijay   26         TU
2  karthik   21         TU
3   venkat   22        THI

In [116]:
##adding age to column
df3 = df2['age'] + 1
print(df3)

0    27
1    27
2    22
3    23
Name: age, dtype: int64

In [101]:
df2

0    27
1    27
2    22
3    23
Name: age, dtype: int64

In [119]:
df.describe()

,YearStart,YearEnd,Response,Data_Value,Data_Value_Alt,Sample_Size,StratificationCategory3,Stratification3,ResponseID,LocationID,StratificationCategoryID3,StratificationID3,Report
count,250937.000000,250937.000000,0.0,169302.000000,169302.000000,0.0,0.0,0.0,0.0,250937.000000,0.0,0.0,0.0
mean,2017.940933,2018.169716,NaN,37.328349,37.328349,NaN,NaN,NaN,NaN,793.866437,NaN,NaN,NaN
std,2.031564,2.081039,NaN,25.213181,25.213181,NaN,NaN,NaN,NaN,2502.174327,NaN,NaN,NaN
min,2015.000000,2015.000000,NaN,0.000000,0.000000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN,NaN
25%,2016.000000,2016.000000,NaN,15.700000,15.700000,NaN,NaN,NaN,NaN,19.000000,NaN,NaN,NaN
50%,2018.000000,2018.000000,NaN,32.300000,32.300000,NaN,NaN,NaN,NaN,34.000000,NaN,NaN,NaN
75%,2020.000000,2020.000000,NaN,56.000000,56.000000,NaN,NaN,NaN,NaN,49.000000,NaN,NaN,NaN
max,2021.000000,2021.000000,NaN,100.000000,100.000000,NaN,NaN,NaN,NaN,9004.000000,NaN,NaN,NaN